#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
     #ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
     #ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
     #ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
     #ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย
print('============================')
print('โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
print('============================')
employee_id = input('ป้อนรหัสพนักงาน : ')
employee_name = input('ป้อนชื่อพนักงาน : ')
sales_amount = float(input('ป้อนยอดขาย (บาท) : '))
print('============================')
if sales_amount <= 1000:
    commission = 0.0
elif 1001 <= sales_amount <= 2000:
    commission = sales_amount * 1 / 100
elif 2001 <= sales_amount <= 3000:
    commission = sales_amount * 3 / 100
else:
    commission = sales_amount * 5 / 100
print(f'พนักงานรหัส {employee_id} ชื่อ {employee_name} มียอดขาย {sales_amount} บาท ได้ค่าคอมมิชชั่น {commission} บาท')
print('============================')