#สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

# ตัวอย่าง
# *****************************************
# **********  โปรแกรมคำนวณผลคูณ  **********
# ป้อนตัวเลขที่ 1 : 100
# ป้อนตัวเลขที่ 2 : 20
# ผลคูณของ 100 และ 20 คือ 2000
# *****************************************
# ป้อนตัวเลขที่ 1 : 50
# ป้อนตัวเลขที่ 2 : 5
# ผลคูณของ 50 และ 5 คือ 250
# *****************************************
# ป้อนตัวเลขที่ 1 : 150
# ป้อนตัวเลขที่ 2 : 20
# ผลคูณของ 150 และ 20 คือ 3000
# *****************************************
# ป้อนตัวเลขที่ 1 : 200
# ป้อนตัวเลขที่ 2 : 50 
# ผลคูณของ 200 และ 50 คือ 10000
# *****************************************
print('*****************************************')
print('**********  โปรแกรมคำนวณผลคูณ  **********')
print('*****************************************')
while True:
    num1 = int(input('ป้อนตัวเลขที่ 1 : '))
    num2 = int(input('ป้อนตัวเลขที่ 2 : '))
    result = num1 * num2
    print(f'ผลคูณของ {num1} และ {num2} คือ {result}')
    print('*****************************************')
    if result > 5000:
        break
print('โปรแกรมหยุดทำงาน')
print('*****************************************')