# โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์
print ('============================')
print ('โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')   
print ('============================')
car_number = input('ป้อนทะเบียนรถบรรทุก : ')
car_weight = float(input('ป้อนน้ำหนักรถบรรทุก (กิโลกรัม) : '))
print ('============================')
if car_weight > 1000:
    print(f'รถทะเบียน {car_number} น้ำหนักรถไม่ผ่านเกณฑ์')
else:
    print(f'รถทะเบียน {car_number} น้ำหนักรถผ่านเกณฑ์')
print ('============================')