#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
	#หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
	#หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
	#หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
	#หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
	#หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
	#หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม
print('============================')
print('โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('============================')
bus_number = input('ป้อนสายรถเมล์ที่ต้องการตรวจสอบ : ')
print('============================')
if bus_number == '57':
    print(f'สาย {bus_number} ไปปิ่นเกล้า บางขุนนนท์')
elif bus_number == '3':
    print(f'สาย {bus_number} ไปสนามหลวง ลาดพร้าว')
elif bus_number == '71':
    print(f'สาย {bus_number} ไปหัวลำโพง เยาวราช')
elif bus_number == '56':
    print(f'สาย {bus_number} ไปบางลำพู สะพานกรุงธน')
elif bus_number == '539':
    print(f'สาย {bus_number} ไปอนุสวรีย์ชัย สามเสน')
else:
    print('ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')
print('============================')